{
  "certification": "csa",
  "topics": [
    {
      "slug": "ui-navigation",
      "name": "User Interface & Navigation",
      "domain": "ui-navigation",
      "description": "Master the ServiceNow user interface including lists, forms, navigation, and the Application Navigator. Learn to customize your workspace for maximum productivity.",
      "introduction": {
        "overview": "The ServiceNow User Interface (UI) is the primary way users interact with the platform. Understanding UI navigation is foundational to everything else you'll do in ServiceNow. This includes mastering the Application Navigator, working with lists and forms, using filters, and customizing your workspace for efficient daily operations.",
        "whyItMatters": "UI & Navigation typically accounts for 15% of the CSA exam. This topic tests your ability to navigate the platform efficiently and understand how end users interact with ServiceNow. Expect questions about list controls, form layouts, related lists, and the Application Navigator structure.",
        "keyConcepts": "Focus on understanding the difference between list views and form views, how to use filters and breadcrumbs, the purpose of related lists, and how to configure personal and system settings. Know how Global Search works and the basics of Connect Chat for collaboration.",
        "examTips": "Pay attention to questions about default behaviors versus configured behaviors. Know the difference between personal list configurations and admin-level changes. Understand how favorites and history work in the Application Navigator."
      },
      "keyConcepts": [
        "Application Navigator",
        "Lists and list controls",
        "Forms and form sections",
        "Related lists",
        "Filters and breadcrumbs",
        "Global search",
        "Connect Chat",
        "System settings"
      ],
      "questionCount": 15,
      "freeQuestionCount": 5
    },
    {
      "slug": "user-administration",
      "name": "User Administration & Security",
      "domain": "user-administration",
      "description": "Learn to manage users, groups, and roles in ServiceNow. Understand Access Control Lists (ACLs) and how to implement security best practices.",
      "introduction": {
        "overview": "User Administration is the backbone of ServiceNow security. Every action in ServiceNow is controlled by a combination of users, groups, roles, and Access Control Lists (ACLs). Understanding this security model is essential for any System Administrator.",
        "whyItMatters": "User Administration accounts for approximately 15% of the CSA exam. Questions focus on how roles grant permissions, how groups organize users, and how ACLs control access to data. This is one of the most practical topics for day-to-day administration work.",
        "keyConcepts": "Master the relationship between users, groups, and roles. Understand role inheritance and how 'contains' relationships work between roles. Know how ACLs evaluate conditions and the order of ACL evaluation. Be familiar with impersonation for testing purposes.",
        "examTips": "Remember that a user needs BOTH a role AND ACL access to see data. Roles grant access to application modules, while ACLs control record-level access. Know the difference between 'admin' role capabilities and regular user permissions."
      },
      "keyConcepts": [
        "User records and profiles",
        "Groups and group membership",
        "Roles and role hierarchies",
        "Access Control Lists (ACLs)",
        "Security rules",
        "Impersonation",
        "Password policies",
        "LDAP/SSO integration"
      ],
      "questionCount": 15,
      "freeQuestionCount": 5
    },
    {
      "slug": "database-administration",
      "name": "Database Administration",
      "domain": "database-administration",
      "description": "Understand the ServiceNow data model, tables, fields, and the data dictionary. Learn to extend tables and manage data effectively.",
      "introduction": {
        "overview": "ServiceNow uses a relational database with a unique inheritance model. Understanding tables, fields, and the data dictionary is crucial for customizing and extending the platform. This knowledge helps you make informed decisions about data structure and system performance.",
        "whyItMatters": "Database Administration covers about 12% of the CSA exam. Questions test your knowledge of table relationships, field types, and data management. You'll need to understand when to extend versus create new tables and how to use import sets for data loading.",
        "keyConcepts": "Know the difference between base tables and extended tables. Understand reference fields and how they create relationships between tables. Be familiar with the data dictionary and how to view table schemas. Learn about import sets, transform maps, and data policies.",
        "examTips": "Focus on table inheritance - know that task is a base table extended by incident, problem, and change_request. Understand that fields inherited from parent tables appear on all child tables. Know which field types are appropriate for different data scenarios."
      },
      "keyConcepts": [
        "Tables and table relationships",
        "Fields and field types",
        "Data dictionary",
        "Table inheritance",
        "Reference fields",
        "Choice lists",
        "Import sets",
        "Data policy"
      ],
      "questionCount": 12,
      "freeQuestionCount": 4
    },
    {
      "slug": "self-service-automation",
      "name": "Self-Service & Automation",
      "domain": "self-service-automation",
      "description": "Configure self-service portals, Service Catalog, Knowledge Management, and automation tools like Flow Designer to improve user experience.",
      "introduction": {
        "overview": "Self-service capabilities empower users to help themselves, reducing ticket volume and improving satisfaction. This includes the Service Catalog for requesting services, Knowledge Base for finding answers, and automation tools like Flow Designer for streamlining processes.",
        "whyItMatters": "Self-Service & Automation represents about 15% of the CSA exam. This is a broad topic covering Service Catalog configuration, Knowledge Management, and workflow automation. Modern questions often focus on Flow Designer rather than legacy workflows.",
        "keyConcepts": "Understand catalog item structure including variables, variable sets, and order guides. Know how Knowledge Base articles are organized and published. Be familiar with Flow Designer triggers, actions, and subflows. Understand the difference between Flow Designer and legacy workflows.",
        "examTips": "Know the components of a catalog item: variables collect information, workflows/flows process requests, and tasks assign work. Understand knowledge article states and the publishing workflow. For Flow Designer, focus on when to use it versus other automation options."
      },
      "keyConcepts": [
        "Service Catalog",
        "Catalog items and variables",
        "Record producers",
        "Order guides",
        "Knowledge Base",
        "Knowledge articles",
        "Flow Designer",
        "Workflows"
      ],
      "questionCount": 15,
      "freeQuestionCount": 5
    },
    {
      "slug": "incident-management",
      "name": "Incident Management",
      "domain": "incident-management",
      "description": "Master ServiceNow Incident Management to restore normal service operation as quickly as possible. Learn incident states, priority, escalation, and resolution.",
      "introduction": {
        "overview": "Incident Management is one of the core ITIL processes in ServiceNow. The goal is to restore normal service operation as quickly as possible while minimizing business impact. This involves managing the entire incident lifecycle from creation through resolution and closure.",
        "whyItMatters": "Incident Management accounts for approximately 12% of the CSA exam. This is a foundational ITSM process that most ServiceNow implementations use. Questions focus on the incident lifecycle, priority calculation, assignment, and SLA management.",
        "keyConcepts": "Master the incident lifecycle states: New, In Progress, On Hold, Resolved, Closed. Understand how Priority is calculated from Impact and Urgency using the priority lookup matrix. Know how assignment rules automatically route incidents and how escalations work.",
        "examTips": "Remember that Resolved is not the same as Closed - there's typically a waiting period for user confirmation. Understand that Priority drives SLA targets. Know the difference between functional and hierarchical escalation. Major Incident Management is a separate process for high-impact situations."
      },
      "keyConcepts": [
        "Incident lifecycle",
        "Priority calculation",
        "Impact and urgency",
        "Assignment rules",
        "Escalation",
        "Major incidents",
        "SLA tracking",
        "Resolution and closure"
      ],
      "questionCount": 12,
      "freeQuestionCount": 4
    },
    {
      "slug": "problem-management",
      "name": "Problem Management",
      "domain": "problem-management",
      "description": "Learn to identify and manage the root cause of incidents through Problem Management. Understand known errors, workarounds, and permanent fixes.",
      "introduction": {
        "overview": "Problem Management focuses on identifying and eliminating the root cause of incidents. While Incident Management restores service quickly, Problem Management prevents future incidents by finding permanent solutions. This proactive approach reduces recurring issues and improves service quality.",
        "whyItMatters": "Problem Management covers about 8% of the CSA exam. While smaller than Incident Management, it's essential for understanding the complete ITSM picture. Questions test your knowledge of the relationship between incidents and problems.",
        "keyConcepts": "Understand the key difference: incidents are symptoms, problems are causes. Know the problem lifecycle and states. Learn about Known Errors - problems with documented workarounds but no permanent fix yet. Understand how to link related incidents to problems.",
        "examTips": "Focus on when to create a problem versus continuing with incident management. Know that problems can be created proactively (trend analysis) or reactively (from incidents). Understand that closing a problem doesn't automatically close related incidents."
      },
      "keyConcepts": [
        "Problem vs Incident",
        "Root cause analysis",
        "Known errors",
        "Workarounds",
        "Problem tasks",
        "Related incidents",
        "Problem states",
        "Permanent fixes"
      ],
      "questionCount": 8,
      "freeQuestionCount": 3
    },
    {
      "slug": "change-management",
      "name": "Change Management",
      "domain": "change-management",
      "description": "Manage IT changes safely with ServiceNow Change Management. Learn change models, CAB approvals, risk assessment, and change schedules.",
      "introduction": {
        "overview": "Change Management ensures that standardized methods are used for efficient handling of all changes. The goal is to minimize the impact of change-related incidents while enabling beneficial changes. ServiceNow provides comprehensive tools for managing the entire change lifecycle.",
        "whyItMatters": "Change Management represents about 10% of the CSA exam. This process is critical for maintaining service stability while enabling innovation. Questions cover change types, the approval process, and risk assessment.",
        "keyConcepts": "Know the three change types: Standard (pre-approved, low risk), Normal (requires CAB approval), and Emergency (expedited for urgent situations). Understand change models as templates for common changes. Learn about the Change Advisory Board (CAB) and their role in approvals.",
        "examTips": "Remember that Standard changes are pre-approved through a change model - they don't need CAB approval each time. Understand the change schedule and blackout windows. Know how risk assessment affects the approval process. Emergency changes still need documentation, just expedited."
      },
      "keyConcepts": [
        "Change types (Standard, Normal, Emergency)",
        "Change models",
        "Change Advisory Board (CAB)",
        "Risk assessment",
        "Change schedule",
        "Conflict detection",
        "Change tasks",
        "Post-implementation review"
      ],
      "questionCount": 10,
      "freeQuestionCount": 4
    },
    {
      "slug": "reporting-dashboards",
      "name": "Reporting & Dashboards",
      "domain": "reporting-dashboards",
      "description": "Create powerful reports and dashboards to visualize ServiceNow data. Learn report types, scheduling, and Performance Analytics basics.",
      "introduction": {
        "overview": "Reporting and dashboards transform raw ServiceNow data into actionable insights. The platform offers various report types for different visualization needs, plus dashboards to combine multiple reports into comprehensive views. Performance Analytics provides advanced trending and KPI tracking.",
        "whyItMatters": "Reporting & Dashboards accounts for about 13% of the CSA exam. Every ServiceNow implementation needs reporting for operational visibility and management decision-making. Questions cover report creation, dashboard design, and basic Performance Analytics concepts.",
        "keyConcepts": "Know the different report types: list, bar, pie, trend, and more. Understand how to create reports using the Report Builder. Learn dashboard basics including adding widgets and configuring layouts. Be familiar with scheduled reports for automated distribution.",
        "examTips": "Focus on when to use different chart types for different data scenarios. Understand the difference between basic reporting and Performance Analytics (PA requires additional licensing). Know how to share reports and dashboards with other users or groups."
      },
      "keyConcepts": [
        "Report types",
        "Report Builder",
        "List reports",
        "Charts and graphs",
        "Dashboards",
        "Widgets",
        "Scheduled reports",
        "Performance Analytics"
      ],
      "questionCount": 13,
      "freeQuestionCount": 5
    }
  ]
}
